package w1;


/**
 * Примечание: в этой задаче не рекомендуется использовать контейнеры.
 * Попробуйте вместо этого воспользоваться сортировкой и работать уже с отсортированным массивом.
 * Разрешается использовать библиотечные методы для сортировки, а не писать свои.
 */
public class Task1 {
    /**
     * Метод вычисляет количество уникальных чисел в массиве "array"
     * @param array массив
     * @return количество уникальных чисел
     */
    public int numberOfUniqueNumbers(int[] array) {
        return 0;
    }

    /**
     * Самое часто встречающееся число. Если таковых несколько, то возвращает любое из них
     * @param array массив
     * @return самое часто встречающееся число (или одно из, если таковых несколько)
     */
    public int mostFrequentNumber(int[] array) {
        return 42;
    }
}
